Lighter-z/stm32-license-Plate-Recognition/user/main.c
#include "stm32f10x.h"
#include "stm32f10x_it.h" 

#include "key.h"
#include "usart.h"
#include "delay.h"
#include "lcd.h"
#include "ov7670.h"

#include "rcc.h"
#include "ShowChar.h"
#include "discern.h"

extern vu8 R_a,G_a,B_a;//阈值


int main(void)
{  
	unsigned int scan_time = 0;
 
	STM32_Clock_Init(16);                                    //初始化时钟

	LCD_GPIO_Init();
	LCD_Init();	
	Key_init();	                                             //初始化 KEY1 PA8
	OV7670_Gpio_Init();                                      //OV7670引脚初始化，放在串口初始化前面
	GPIO_WriteBit(FIFO_OE_PORT, FIFO_OE_PIN, 0);
	//USART1_init();                                         //初始化串口	

	TIM3_Configuration();                                    //10Khz的计数频率，计数到5000为500ms  
	LCD_Fill(0x6666);		
	while(!Sensor_init());
	
	LCD_Fill(0xF800);
	delayms(100);
	scan_time = 2;
	
  //二值化阈值	
	R_a=24;
	G_a=53;
	B_a=24;

	while(1)
	{
		if(scan_time <= 1) {
			CameraDiscern();//车牌测定
		}
		if(scan_time > 1) {
			CameraScan();//摄像头扫描测试
			LCD_ShowNum(30,220,21 - scan_time, 2); 
			while(GPIO_ReadInputDataBit(KEY1_PORT,KEY1_PIN)==0)
			{
				LCD_Fill(0x00);//黑屏
				Show_Title();//显示标题
				Show_Card(0);//显示第几组车牌
				Show_Card(1);
				Show_Card(2);
				Show_Card(3);
				Show_Card(4);
				delay_ms(5000);
			}
		}
		if(scan_time == 20) {
			 scan_time = 0;
		}
		scan_time++;
	} 
}


